export const MESSAGES = {
  START_APP: `
    Приветствую🤖

    Воспользуйтесь меню👇🏻`,
  UNDEF_COMMAND: `
    Я ещё не понимаю как ответить на эту команду🤖

    Воспользуйтесь меню👇🏻`,
  MENU: `Выберете нужный вам пункт👇🏻`,
  INSTRUCTION:`
    Привет👋🏻
    Я помогу тебе скачать приложение Poizon и рассчитать правильно стоимость своего заказа!
  
    Для начала нужно скачать приложение: 
  
    ⁃ IOS
    https://apps.apple.com/us/app/%E5%BE%97%E7%89%A9-%E5%BE%97%E5%88%B0%E8%BF%90%E5%8A%A8x%E6%BD%AE%E6%B5%81x%E5%A5%BD%E7%89%A9/id1012871328?l=ru
  
    ⁃ ANDROID 
    https://m.anxinapk.com/rj/12201303.html
  
    ￼
    После того, как установили приложение - выбираем вторую вкладку👇🏻
  
    ￼
  
  
    1️⃣
    Ищем товар.
    Пишем в поисковой строке название бренда/товара на английском языке.
    К примеру: Air Jordan, Air Force, Adidas, New Balance и т.п 
  
    2️⃣
    Выбираем понравившийся товар, после чего нажимаем на «голубую» кнопку в правом нижнем углу.
    Далее подбираем свой размер и смотрим на итоговую стоимость в юанях(¥) при заказе по «голубой» кнопке
  
    ￼
  
     ￼
  
    ⚡️Эту стоимость ты можешь ввести в боте и он рассчитает итоговую стоимость заказа в рублях(₽)
  
    ￼
  
    Теперь ты готов сделать заказ!
  
    ⚠️Перед тем как писать мне, убедись, что тебя устраивает цена, кликай на «РАССЧИТАТЬ СТОИМОСТЬ», либо же сразу пиши мне «ОФОРМИТЬ ЗАКАЗ»`,
  DELIVERY: `
    После оплаты заказа я выкупаю его в этот же день📦

    Посылка доставляется до нашего склада в Китае: 
    ⚪️2-3 дня или 5-6 дней 
  
    После чего она отправляется в Санкт-Петербург, в среднем это занимает около:
    ⚪️ 14-21 дней
  
    После того, как посылка приехала в Санкт-Петербург возможно сделать: 
    1️⃣Самовывоз 
    2️⃣Доставка по городу курьером Яндекс
    3️⃣Отправка в любой другой город Сдэк’ом
  
    Стоимость доставки до Санкт-Петербурга: 
    ⚡️2.300₽ - Обувь 
    ⚡️2.000₽ - Верхняя одежда 
    ⚡️1.500₽ - Футболка, штаны, шорты 
    ⚡️1.100₽ - Носки, трусы 
    ⚡️Комиссия 5% от общей/итоговой стоимости заказа за каждую вещь!
  
    🟨Опт от 10-100 вещей:
    От 10 позиций 1.100₽/кг
    От 50 позиций 970₽/кг
    От 100 позиций 890₽/кг
    (Цена за кг может меняться в зависимости от курса $)
  
    📦Доставка курьером Яндекс или Сдэк’ом в другой город оплачивается отдельно!`,
} as const

